{
  "unreleased": [],
  "releases": {
    "0.3.12": [
      "[Improved] Add some padding around image diffs so that it's easier to grab the slider",
      "[Fixed] Closing a sketch file in the changes list would make it disappear"
    ],
    "0.3.11": [
      "[Fixed] Fetching the diff for a commit in the history tab"
    ],
    "0.3.10": [
      "[Fixed] A case where fetching the diff for a conflict would fail"
    ],
    "0.3.9": [
      "[Fixed] Handle Sketch files with pages with the same name"
    ],
    "0.3.8": [
      "[Fixed] Bug which crash Kactus on startup"
    ],
    "0.3.7": [
      "[New] New history tab with possibility to compare to a branch",
      "[Improved] Performances when rendering the list of changes",
      "[Improved] Performance when getting the preview from Sketch, it is now in another thread so you should be able to interact with the UI while is it fetching them (and look at the text diff)",
      "[Fixed] A bug where Kactus would crash while trying to show a non-existing preview"
    ],
    "0.3.6": [
      "[Fixed] Remove Bitcoin payment (removed by Stripe)",
      "[Improved] Remove collection of usage data. We are not looking at them and we don't like collecting data for the sake of it",
      "[Improved] Use update.electronjs.org as the update server",
      "[Improved] Add warning when renaming a branch",
      "[Improved] Getting the git status should a lot faster (up to 15 times)"
    ],
    "0.3.5": [
      "[Fixed] Fix the color of the buttons on hover",
      "[Fixed] Do not try to generate a file preview when it hasn't been imported yet",
      "[Fixed] Do not try to generate a file preview when we failed to generate one",
      "[Improved] Try to recover when some references in a file are missing. This can be due to a merge than went wrong for example",
      "[Improved] Prepare the plugin for Sketch 50"
    ],
    "0.3.4": [
      "[Fixed] Fix a bug where the wrong user account would be used to authenticate"
    ],
    "0.3.3": [
      "[Improved] Faster Kactus status (finding the Sketch files)",
      "[Improved] Faster Git status (finding the changed files)"
    ],
    "0.3.2": [
      "[New] Add a new indicator if the branch is a PR",
      "[Improved] Do not export the commit meta key of the sketch file"
    ],
    "0.3.1": [
      "[New] Add visual diffs for SVGs",
      "[Improved] Fetching the Sketch files is now around 4 times faster!",
      "[Improved] When there are too many new files (like when adding a new Sketch file), fall to show only the new directory",
      "[Improved] Store the modification date of sketch files so that there open Kactus is now lightning fast",
      "[Improved] Add some logs for Kactus to help debugging",
      "[Improved] Show text diff as an option instead of checkbox",
      "[Fixed] Fix generating preview for new parts"
    ],
    "0.3.0": [
      "[New] Add a view to fix conflicts",
      "[Improved] Safer regeneration of sketch file",
      "[Improved] Show conflicts icon all the way up (to make sure you don't commit conflicts because the file is folded)",
      "[Fixed] Fix typo (refound -> refund)"
    ],
    "0.2.14": [
      "[Fixed] Could not unselect a changed file",
      "[Improved] Optimize SVG to reduce the bundle size and render time",
      "[Improved] add preview to the sketch file view"
    ],
    "0.2.13": [
      "[Fixed] A bug breaking Sketch file when using shared text styles in shared pages"
    ],
    "0.2.12": ["[Fixed] Code signing on macOS"],
    "0.2.11": [
      "[New] Add PR list",
      "[Fixed] Fix preview of sketch document",
      "[Fixed] Fix shortcut to open Kactus from Sketch (ctrl + k)"
    ],
    "0.2.10": [
      "[Improved] Faster file selection",
      "[Fixed] GitHub Enterprise login. For it to work, you will need to create a GitHub application. There are instructions about how to do so when you need it."
    ],
    "0.2.9": [
      "[New] Add ability to cancel a premium subscription from the app",
      "[Improved] Check wether sketch files are ignored when add an existing repo",
      "[Fixed] Fix washed out icon on High Sierra"
    ],
    "0.2.8": [
      "[New] Store the Sketch version used so that Sketch always uses the latest features and do not tries to transform the file",
      "[Improved] Big performance improvements when showing diffs: around 50% for completely new diffs and nearly instant for already seen diffs"
    ],
    "0.2.7": [
      "[New] Allow users to create repositories with descriptions",
      "[New] Use `lfs clone` for faster cloning of LFS repositories",
      "[Improved] Prompt to override existing LFS filters",
      "[Improved] Add more logs for kactus operations",
      "[Fixed] Don't install LFS hooks when checking if a repo uses LFS",
      "[Fixed] \"Clone with Desktop\" wouldn't include the repository name in the path",
      "[Fixed] Use the loading/disabled state while publishing",
      "[Fixed] Lock down menu item states for unborn repositories",
      "[Fixed] Fix a bug that could prevent the document.json to be created when parsing pages with images",
      "[Fixed] Use the version map to generate a sketch file with the current sketch version"
    ],
    "0.2.6": [
      "[New] 'Open in Shell' now supports multiple shells",
      "[Fixed] Keep order of sketch pages (#51)"
    ],
    "0.2.5": [
      "[Improved] Indent files in a sketch file",
      "[Improved] Added cta in accounts to unlock kactus",
      "[Fixed] Safer parsing of sketch part (#49)",
      "[Fixed] Changed link to help (#50)"
    ],
    "0.2.4": [
      "[New] Changed files in a sketch file are now grouped in a tree.",
      "[Improved] Added a loading indicator when generating the diffs",
      "[Fixed] Create folders to new sketch file if needed"
    ],
    "0.2.3": [
      "[New] Can choose whether a branch should be deleted on the remote as well as locally",
      "[New] Added the ability to revert a commit",
      "[Improved] Fetch if a push fails because they need to pull first",
      "[Improved] Discard changes performance",
      "[Fixed] Show 'Add Repository' dialog when repository is dragged onto the app",
      "[Fixed] Dialog component did not remove event handler",
      "[Fixed] Update to Git 2.14.1 to fix security vulnerability",
      "[Fixed] Changing the default branch on GitHub.com is now reflected in the app",
      "[Fixed] Swap around some callouts for no repositories",
      "[Fixed] Darker unfocused selection color",
      "[Fixed] Increase the max sidebar width",
      "[Fixed] Don't say \"Publish this branch to GitHub\" for non-GitHub repositories",
      "[Fixed] Patches which contain the \"no newline\" marker would fail to apply",
      "[Fixed] Close the autocompletion popover when it loses focus",
      "[Fixed] Clear the selected org when switching Publish Repository tabs",
      "[Fixed] 'Create Without Pushing' button throwing an exception while opening a pull request",
      "[Fixed] Publishing a repository would try to check for full access status first"
    ],
    "0.2.2": ["[Fixed] Create a new sketch file with shared styles would fail"],
    "0.2.1": [
      "[Fixed] Fixed getting the previous preview (which resulted in showing the same image for both preview)"
    ],
    "0.2.0": [
      "[New] You can now use any git server (BitBucket, Gitlab, self-hosted, etc.)!",
      "[New] Adds short-cut to open terminal",
      "[Improved] Add a loading git status indicator",
      "[Improved] Add an options menu to the Commit Summary component",
      "[Improved] Only enable Reload for dev builds",
      "[Improved] Handle updating a premium subscription to an enterprise subscription",
      "[Fixed] Fixed a bug where the unlock status wouldn't be set right after unlocking and necessitate a restart of Kactus"
    ],
    "0.1.16": [
      "[Fixed] Fix a bug when a page contained a `/`",
      "[Improved] Add a separate loading indicator on each sketch file",
      "[Improved] Show directly the sketch files when loading the status. That way we can show a loading indicator while parsing the files",
      "[Fixed] Fix storing the sketch path when locating the app",
      "[Fixed] Fixed a bug where an account could be deduplicated"
    ],
    "0.1.15": [
      "[New] Added the Branch > Create Pull Request menu item",
      "[New] Added a button to locate sketch when not found #34",
      "[New] Added a button to open an sketch file from a previous commit. This file is temporary, do not try to save it and work from there. #23",
      "[Fixed] Use the right version when creating a sketch file",
      "[Improved] Do not store the style when it’s the same as the shared one #36"
    ],
    "0.1.14": ["[Fixed] not creating a folder to export images"],
    "0.1.13": [
      "[Fixed] handle shared style diff",
      "[Fixed] fix a bug where it was impossible to select another file",
      "[Fixed] respect the root config",
      "[Fixed] Revert parsing _archive string as some info were getting lost when parsing to JS (which doesn't support 64 int). So it's a bit uglier but at least it's working"
    ],
    "0.1.12": [
      "[Fixed] Configuring git form not submitting #27",
      "[Fixed] Extra repository settings tab #25",
      "[Fixed] Crash when adding twice the same shared page"
    ],
    "0.1.11": [
      "[Improved] UI to change the kactus config #7",
      "[Fixed] Repository Settings not working properly if updating kactus.json outside #22"
    ],
    "0.1.10": [
      "[Improved] increase the time between which we check for kactus status",
      "[Fixed] Wrong error message when trying to publish a private repo without GitHub premium account"
    ],
    "0.1.9": [
      "[Fixed] fix building sketch file with outdated version #17",
      "[Fixed] fix help menu items not responding"
    ],
    "0.1.8": [
      "[Fixed] Handle bitmap and Symbol master diffs",
      "[Fixed] sort json keys so that it's always the same order #19",
      "[Fixed] Wrong stripe key (that's embarrassing)"
    ],
    "0.1.7": [
      "[Improved] Move forgot password link to actions section",
      "[Fixed] Fix size of image diffs #15",
      "[Improved] Add a notification popup whenever a user toggles on full screen mode informing how to get out of full screen mode"
    ],
    "0.1.6": ["[Fixed] Update price shown when using a coupon"],
    "0.1.5": [
      "[Fixed] Recreate the sketch files before get the git status when merging a branch"
    ],
    "0.1.4": [
      "[Fixed] Remove kactus previews cache when removing a repo",
      "[Fixed] Fix link to help",
      "[Fixed] File typo on 'no changes' view",
      "[Fixed] Fix getting the git status before parsing the sketch files at the very beginning"
    ],
    "0.1.3": [
      "[Fixed] Previews on sketch 45",
      "[New] Refresh opened sketch files when importing one",
      "[New] Add export and import plugin commands",
      "[Fixed] Fix size of changed files list"
    ],
    "0.1.2": [
      "[New] Automatically parse sketch files when changed",
      "[Improved] Directly show text diff for document.json"
    ],
    "0.1.1": [
      "[New] Check the Sketch version and warn if it's not good",
      "[Fixed] Fix missing buttons to login"
    ],
    "0.1.0": [
      "[New] Add cmd+k shortcut to open sketch",
      "[New] Add some actions when there is no change",
      "[Improved] Parse _archive fields in sketch files",
      "[Fixed] Wrong scheme for oauth #5"
    ],
    "0.1.0-alpha6": [
      "[New] Add a sketch plugin to open the file in Kactus",
      "[Fixed] Correct URL for the usage reporting"
    ],
    "0.1.0-alpha5": [
      "[New] Create a new sketch file with all the kactus options"
    ],
    "0.1.0-alpha4": ["[New] Brand new image diffs"],
    "0.1.0-alpha3": ["[Fixed] Handle sketch files with images"],
    "0.1.0-alpha2": ["[New] Bunch of stuff"],
    "0.1.0-alpha1": ["[New] First alpha release of Kactus"]
  }
}
